%{
ƒ¡ƒÏ?ƒÕƒÑƒÃ ƒÐƒÒƒË?ƒÏƒÑƒÅƒÐƒÅ MATLAB, ƒÎƒÍƒÒ ƒËƒ¿ ƒÃƒÉ?ƒÁƒÔƒÃƒÇ ƒ¿ƒË ƒÅ ƒÈ?ƒÆƒÃ ƒÁƒÏƒ¿ƒÊƒÊ? ƒÂƒÃƒÂƒÍƒÊ?ƒËƒÍƒÒ
ƒÂƒÇƒÐƒÂƒÇ?ƒÐƒÑƒ¿ƒÑƒÍƒÒ ƒÎ?ƒËƒ¿ƒÈƒ¿ ƒ¿ƒÈƒÃƒÏƒ¿?ƒÖƒË, ƒÃ?ƒËƒ¿ƒÇ ƒÂƒÇƒ¿ƒÑƒÃƒÑƒ¿ƒÁƒÊ?ƒËƒÅ ? ?ƒÔƒÇ. ƒ¥ ƒÊ?ƒÆƒÍƒÂ?? ƒÐƒ¿?
ƒÎƒÏ?ƒÎƒÃƒÇ ƒËƒ¿ ƒÃƒÉ?ƒÁƒÔƒÃƒÇ ?ƒÉƒÃ? ƒÑƒÇ? ƒÁƒÏƒ¿ƒÊƒÊ?? ƒÑƒÍƒÒ ƒÎ?ƒËƒ¿ƒÈƒ¿ ƒÈƒ¿ƒÇ ƒËƒ¿ ƒÃƒÎƒÇƒÐƒÑƒÏ?ƒÓƒÃƒÇ ƒÊƒÍƒËƒÍƒÂƒÇ?ƒÐƒÑƒ¿ƒÑƒÍ
ƒÎ?ƒËƒ¿ƒÈƒ¿ ƒ¿ƒÈƒÃƒÏƒ¿?ƒÖƒË ƒÊƒÃ ƒÑƒÇƒÊ?? :
? ƒÑƒÍƒË ƒ¿ƒÏƒÇƒÆƒÊ? ?1 ƒÐƒÑƒÇ? ??ƒÐƒÃƒÇ? ƒÑƒÖƒË ƒÊƒÅ-ƒÂƒÇƒ¿ƒÑƒÃƒÑƒ¿ƒÁƒÊ?ƒËƒÖƒË ƒÁƒÏƒ¿ƒÊƒÊ?ƒË ƒÑƒÍƒÒ ƒÂƒÇƒÐƒÂƒÇ-
?ƒÐƒÑƒ¿ƒÑƒÍƒÒ ƒÎ?ƒËƒ¿ƒÈƒ¿,
? ƒÑƒÍƒË ƒ¿ƒÏƒÇƒÆƒÊ? 0 ƒÐƒÑƒÇ? ??ƒÐƒÃƒÇ? ƒÑƒÖƒË ƒÁƒÏƒ¿ƒÊƒÊ?ƒË ƒÊƒÃ ?ƒÆ?ƒËƒÍƒÒƒÐƒ¿ ƒÂƒÇ?ƒÑƒ¿ƒÌƒÅ ƒÈƒ¿ƒÇ
? ƒÑƒÍƒË ƒ¿ƒÏƒÇƒÆƒÊ? 1 ƒÐƒÑƒÇ? ??ƒÐƒÃƒÇ? ƒÑƒÖƒË ƒÁƒÏƒ¿ƒÊƒÊ?ƒË ƒÊƒÃ ƒ¿?ƒÌƒÍƒÒƒÐƒ¿ ƒÂƒÇ?ƒÑƒ¿ƒÌƒÅ.
ƒ¦ƒÃƒÖƒÏ?ƒÐƒÑƒÃ, ƒÔƒÖƒÏ?? ?ƒÉƒÃƒÁƒÔƒÍ, ?ƒÑƒÇ ƒÑƒ¿ ƒÐƒÑƒÍƒÇƒÔƒÃ?ƒ¿ ƒÈ?ƒÆƒÃ ƒÁƒÏƒ¿ƒÊƒÊ?? ƒÃ?ƒËƒ¿ƒÇ ƒÂƒÇƒ¿ƒÓƒÍƒÏƒÃƒÑƒÇƒÈ? ƒÊƒÃ-
ƒÑƒ¿ƒÌ? ƒÑƒÍƒÒ?.
%}

function v = arrayCheck(A)
[m,n]=size(A);
v=zeros(m,1);
for i=1:m
  j=3;
  if A(i,1)>A(i,2)
    while j<=n && v(i)==0
      if A(i,j)>A(i,j-1)
        v(i)=-1;
      endif
      j=j+1;
    endwhile
  else
    v(i)=1;
    while j<=n && v(i)==1
      if A(i,j)<A(i,j-1)
        v(i)=-1;
      endif
      j=j+1;
    endwhile
  endif
endfor
