%{
Γράψτε συνάρτηση MATLAB, που να ελέγχει αν η κάθε γραµµή δεδοµένου
δισδιάστατου πίνακα ακεραίων, είναι διατεταγµένη ή όχι. Η µέθοδός σας
πρέπει να ελέγχει όλες τις γραµµές του πίνακα και να επιστρέφει µονοδιάστατο
πίνακα ακεραίων µε τιµές :
• τον αριθµό −1 στις ϑέσεις των µη-διατεταγµένων γραµµών του δισδι-
άστατου πίνακα,
• τον αριθµό 0 στις ϑέσεις των γραµµών µε ϕθίνουσα διάταξη και
• τον αριθµό 1 στις ϑέσεις των γραµµών µε αύξουσα διάταξη.
Θεωρήστε, χωρίς έλεγχο, ότι τα στοιχεία κάθε γραµµής είναι διαφορετικά µε-
ταξύ τους.
%}

function v = arrayCheck(A)
[m,n]=size(A);
v=zeros(m,1);
for i=1:m
  j=3;
  if A(i,1)>A(i,2)
    while j<=n && v(i)==0
      if A(i,j)>A(i,j-1)
        v(i)=-1;
      endif
      j=j+1;
    endwhile
  else
    v(i)=1;
    while j<=n && v(i)==1
      if A(i,j)<A(i,j-1)
        v(i)=-1;
      endif
      j=j+1;
    endwhile
  endif
endfor
