%{
Γράψτε συνάρτηση MATLAB που να δέχεται σαν είσοδο ένα ϕυσικό αριθµό a
και να κατασκευάζει τυχαίο πίνακα a επί a τέτοιον ώστε :
1. τα στοιχεία των ϑέσεων των οποίων και οι δύο συντεταγµένες είναι περιτ-
τοί να είναι -1, 0, ή 1 µε την ίδια πιθανότητα,
2. τα υπόλοιπα στοιχεία να είναι το άθροισµα των συντεταγµένων των ϑέσε-
ών τους.
%}
function E = randM(a)
  E=zeros(a);
for i=1:a
 for j=1:a
  if rem(i,2)~=0 && rem(j,2)~=0
   r=rand;
   if r<=1/3
    E(i,j)=-1;
	elseif r<=2/3
	E(i,j)=0;
	else
	E(i,j)=1;
   end
  else
  E(i,j)=i+j;
  end
 end
end
