%{
ƒ¡ƒÏ?ƒÕƒÑƒÃ ƒÐƒÒƒË?ƒÏƒÑƒÅƒÐƒÅ MATLAB ƒÎƒÍƒÒ ƒËƒ¿ ƒÂ?ƒÔƒÃƒÑƒ¿ƒÇ ƒÐƒ¿ƒË ƒÃ?ƒÐƒÍƒÂƒÍ ?ƒËƒ¿ ?ƒÒƒÐƒÇƒÈ? ƒ¿ƒÏƒÇƒÆƒÊ? a
ƒÈƒ¿ƒÇ ƒËƒ¿ ƒÈƒ¿ƒÑƒ¿ƒÐƒÈƒÃƒÒ?ƒÄƒÃƒÇ ƒÑƒÒƒÔƒ¿?ƒÍ ƒÎ?ƒËƒ¿ƒÈƒ¿ a ƒÃƒÎ? a ƒÑ?ƒÑƒÍƒÇƒÍƒË ?ƒÐƒÑƒÃ :
1. ƒÑƒ¿ ƒÐƒÑƒÍƒÇƒÔƒÃ?ƒ¿ ƒÑƒÖƒË ??ƒÐƒÃƒÖƒË ƒÑƒÖƒË ƒÍƒÎƒÍ?ƒÖƒË ƒÈƒ¿ƒÇ ƒÍƒÇ ƒÂ?ƒÍ ƒÐƒÒƒËƒÑƒÃƒÑƒ¿ƒÁƒÊ?ƒËƒÃ? ƒÃ?ƒËƒ¿ƒÇ ƒÎƒÃƒÏƒÇƒÑ-
ƒÑƒÍ? ƒËƒ¿ ƒÃ?ƒËƒ¿ƒÇ -1, 0, ? 1 ƒÊƒÃ ƒÑƒÅƒË ?ƒÂƒÇƒ¿ ƒÎƒÇƒÆƒ¿ƒË?ƒÑƒÅƒÑƒ¿,
2. ƒÑƒ¿ ƒÒƒÎ?ƒÉƒÍƒÇƒÎƒ¿ ƒÐƒÑƒÍƒÇƒÔƒÃ?ƒ¿ ƒËƒ¿ ƒÃ?ƒËƒ¿ƒÇ ƒÑƒÍ ?ƒÆƒÏƒÍƒÇƒÐƒÊƒ¿ ƒÑƒÖƒË ƒÐƒÒƒËƒÑƒÃƒÑƒ¿ƒÁƒÊ?ƒËƒÖƒË ƒÑƒÖƒË ??ƒÐƒÃ-
?ƒË ƒÑƒÍƒÒ?.
%}
function E = randM(a)
  E=zeros(a);
for i=1:a
 for j=1:a
  if rem(i,2)~=0 && rem(j,2)~=0
   r=rand;
   if r<=1/3
    E(i,j)=-1;
	elseif r<=2/3
	E(i,j)=0;
	else
	E(i,j)=1;
   end
  else
  E(i,j)=i+j;
  end
 end
end